#include<iostream>
#include<vector>
#include<assert.h>
#include<algorithm>
#include<string>
#include<clocale>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	cout << "Всего один шаг и вчерашний скиталец," << "\n" << "Сегодняшний хладный мертвец." << "\n";
	cout << "Горела душа пока жаркое пламя" << "\n" << "На ноль не сошло наконец." << "\n" << "\n";
	cout << "Попутчик Харона не встанет из пепла," << "\n" << "Не выпустит боле Морфей," << "\n";
	cout << "Фортуна проводит лишь взором холодным" << "\n" << "Не давши улыбки своей." << "\n" << "\n";
	cout << "И вот наш герой, представ пред Шакалом," << "\n" << "Ждёт страшный, но праведный суд," << "\n";
	cout << "Но сердце с пером всё танцуют свой танец" << "\n" << "В течение долгих минут..." << endl;
}